In [189]:
import pandas as pd
import numpy as np
import datetime as dt

In [2]:
url = 'https://raw.githubusercontent.com/Datamanim/datarepo/main/worldcup/worldcupgoals.csv'

In [3]:
df= pd.read_csv(url)
df.head()

           Player  Goals                Years  Country
0  Miroslav Klose     16  2002-2006-2010-2014  Germany
1         Ronaldo     15       1998-2002-2006   Brazil
2     Gerd Muller     14            1970-1974  Germany
3   Just Fontaine     13                 1958   France
4            Pele     12  1958-1962-1966-1970   Brazil

Q21. 주어진 전체 기간의 각 나라별 골득점수 상위 5개 국가와 그 득점수를 데이터프레임형태로 출력하라

In [4]:
df.groupby('Country').sum('Goals').sort_values('Goals',ascending = False).head()

           Goals
Country
Brazil       228
Germany      226
Argentina    135
Italy        123
France       115

In [5]:
df.groupby('Country').sum().sort_values('Goals',ascending = False).head()

           Goals
Country
Brazil       228
Germany      226
Argentina    135
Italy        123
France       115

Q22. 주어진 전체기간동안 골득점을 한 선수가 가장 많은 나라 상위 5개 국가와 그 선수 숫자를 데이터 프레임 형식으로 출력하라

In [6]:
df.groupby('Country')['Player'].count().sort_values(ascending = False).to_frame().head()

           Player
Country
Brazil         81
Germany        78
Italy          60
Argentina      59
France         58

In [7]:
df.groupby('Country').size().sort_values(ascending = False).to_frame('Player').head()

           Player
Country
Brazil         81
Germany        78
Italy          60
Argentina      59
France         58

## Q23. Years 컬럼은 년도 -년도 형식으로 구성되어있고, 각 년도는 4자리 숫자이다. 년도 표기가 4자리 숫자로 안된 케이스가 존재한다. 해당 건은 몇건인지 출력하라

In [8]:
df.head(3)

           Player  Goals                Years  Country
0  Miroslav Klose     16  2002-2006-2010-2014  Germany
1         Ronaldo     15       1998-2002-2006   Brazil
2     Gerd Muller     14            1970-1974  Germany

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1295 entries, 0 to 1294
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Player   1295 non-null   object
 1   Goals    1295 non-null   int64
 2   Years    1295 non-null   object
 3   Country  1295 non-null   object
dtypes: int64(1), object(3)
memory usage: 40.6+ KB

In [10]:
year = df.Years.apply(lambda x: list(x.split('-')[i] for i in range(len(x.split('-')))))
year

0       [2002, 2006, 2010, 2014]
1             [1998, 2002, 2006]
2                   [1970, 1974]
3                         [1958]
4       [1958, 1962, 1966, 1970]
                  ...
1290                      [1962]
1291                [1982, 1990]
1292                      [1930]
1293                      [1930]
1294                [1954, 1958]
Name: Years, Length: 1295, dtype: object

In [47]:
num = 0
for i in range(len(year)):
    for j in range(len(year[i])):
        if int(year[i][j]) / 1000 < 1 :
            num += 1
num

45

In [11]:
df['yearLst'] = df.Years.str.split('-')

In [22]:
str(df.yearLst[0])

"['2002', '2006', '2010', '2014']"

In [12]:
len(str(df.yearLst[0]))

32

In [23]:
len(str(df.yearLst[1]))

24

In [24]:
len(str(df.yearLst[2]))

16

In [25]:
len(str(df.yearLst[3]))

8

In [26]:
def check(x):
    for value in x:
        if len(str(value)) != 4:
            return False
    return True

In [27]:
df['check'] = df.yearLst.apply(check)
len(df[df.check == False])

45

Q24. **Q3에서 발생한 예외 케이스를 제외한 데이터프레임을 df2라고 정의하고 데이터의 행의 숫자를 출력하라 (아래 문제부터는 df2로 풀이하겠습니다) **

In [30]:
df2 = df[df.check !=False]

In [31]:
len(df2)

1250

In [32]:
df2.shape[0]

1250

## Q25. 월드컵 출전횟수를 나타내는 ‘LenCup’ 컬럼을 추가하고 4회 출전한 선수의 숫자를 구하여라

In [33]:
df2.head(3)

,Player,Goals,Years,Country,yearLst,check
0,Miroslav Klose,16,2002-2006-2010-2014,Germany,"[2002, 2006, 2010, 2014]",True
1,Ronaldo,15,1998-2002-2006,Brazil,"[1998, 2002, 2006]",True
2,Gerd Muller,14,1970-1974,Germany,"[1970, 1974]",True

In [45]:
df2['LenCup'] = df2.yearLst.apply(lambda x: len(x))

C:\Users\User\AppData\Local\Temp\ipykernel_4104\4099048323.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['LenCup'] = df2.yearLst.apply(lambda x: len(x))

In [49]:
df2.loc[df2.LenCup == 4,'LenCup'].count()

16

In [51]:
df2.yearLst.str.len().value_counts()[4]

16

Q26. Yugoslavia 국가의 월드컵 출전횟수가 2회인 선수들의 숫자를 구하여라

In [52]:
df2.head(3)

,Player,Goals,Years,Country,yearLst,check,LenCup
0,Miroslav Klose,16,2002-2006-2010-2014,Germany,"[2002, 2006, 2010, 2014]",True,4
1,Ronaldo,15,1998-2002-2006,Brazil,"[1998, 2002, 2006]",True,3
2,Gerd Muller,14,1970-1974,Germany,"[1970, 1974]",True,2

In [65]:
len(df2[df2.Country == 'Yugoslavia'][df2[df2.Country == 'Yugoslavia'].LenCup == 2])

7

In [67]:
len(df2[(df2.LenCup == 2) & (df2.Country == 'Yugoslavia')])

7

Q27. 2002년도에 출전한 전체 선수는 몇명인가?

In [69]:
df2.Years.str.contains('2002').sum()

156

Q28. 이름에 ‘carlos’ 단어가 들어가는 선수의 숫자는 몇 명인가? (대, 소문자 구분 x)

In [78]:
df2.Player.str.lower().str.contains('carlos').sum()

13

Q29. 월드컵 출전 횟수가 1회뿐인 선수들 중에서 가장 많은 득점을 올렸던 선수는 누구인가?

In [84]:
df2[df2.LenCup == 1].sort_values('Goals', ascending = False)['Player'].iloc[0]

'Just Fontaine'

Q30. 월드컵 출전횟수가 1회 뿐인 선수들이 가장 많은 국가는 어디인가?

In [94]:
df2[df2.LenCup == 1].groupby('Country').size().sort_values(ascending = False).index[0]

'Brazil'

In [97]:
df2[df2.LenCup == 1].Country.value_counts().index[0]

'Brazil'

## 서울시 따릉이 이용정보

In [190]:
url = 'https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv'
df = pd.read_csv(url)

In [191]:
df.head(3)

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18

Q31. 대여일자별 데이터의 수를 데이터프레임으로 출력하고, 가장 많은 데이터가 있는 날짜를 출력하라

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 678950 entries, 0 to 678949
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    678950 non-null  object
 1   대여시간    678950 non-null  int64
 2   대여소번호   678950 non-null  int64
 3   대여구분코드  678950 non-null  object
 4   성별      678950 non-null  object
 5   연령대코드   678950 non-null  object
 6   이용건수    678950 non-null  int64
 7   운동량     678950 non-null  object
 8   탄소량     678950 non-null  object
 9   이동거리    678950 non-null  float64
 10  사용시간    678950 non-null  int64
dtypes: float64(1), int64(4), object(6)
memory usage: 57.0+ MB

In [105]:
df.대여일자.value_counts().sort_values(ascending = False).to_frame()

             대여일자
2021-06-04  56788
2021-06-02  56100
2021-06-08  55623
2021-06-14  54945
2021-06-09  54507
2021-06-05  52730
2021-06-07  52623
2021-06-11  52089
2021-06-12  48569
2021-06-01  48081
2021-06-06  47787
2021-06-13  43131
2021-06-10  36992
2021-06-03  18985

In [106]:
df.대여일자.value_counts().sort_values(ascending = False).to_frame().index[0]

'2021-06-04'

Q32. 각 일자의 요일을 표기하고 (‘Monday’ ~’Sunday’) ‘day_name’컬럼을 추가하고 이를 이용하여 각 요일별 이용 횟수의 총합을 데이터 프레임으로 출력하라

In [243]:
df.대여일자 = pd.to_datetime(df.대여일자)

In [244]:
df['day_name'] = df.대여일자.dt.day_name()

In [245]:
df.day_name.value_counts().to_frame()

           day_name
Wednesday    110607
Friday       108877
Monday       107568
Tuesday      103704
Saturday     101299
Sunday        90918
Thursday      55977

## Q33. 각 요일별 가장 많이 이용한 대여소의 이용횟수와 대여소 번호를 데이터 프레임으로 출력하라

In [143]:
df.groupby(['day_name','대여소번호']).size().to_frame('size').sort_values(['day_name','size']).reset_index().drop_duplicates('day_name',keep='last').reset_index(drop=True)

    day_name  대여소번호  size
0     Friday    502   277
1     Monday    502   242
2   Saturday    502   378
3     Sunday    502   372
4   Thursday   2715   137
5    Tuesday    502   267
6  Wednesday    502   282

Q34. 나이대별 대여구분 코드의 (일일권/전체횟수) 비율을 구한 후 가장 높은 비율을 가지는 나이대를 확인하라. 일일권의 경우 일일권 과 일일권(비회원)을 모두 포함하라

In [144]:
df.head(3)

,대여일자,대여시간,대여소번호,대여구분코드,성별,연령대코드,이용건수,운동량,탄소량,이동거리,사용시간,day_name
0,2021-06-01,0,3541,정기권,F,~10대,1,0.00,0.00,0.00,8,Tuesday
1,2021-06-01,0,765,정기권,F,~10대,1,27.21,0.35,1526.81,19,Tuesday
2,2021-06-01,0,2637,정기권,F,~10대,1,41.40,0.37,1608.56,18,Tuesday

In [145]:
df.대여구분코드.unique()

array(['정기권', '일일권', '단체권', '일일권(비회원)'], dtype=object)

In [146]:
df.연령대코드.unique()

array(['~10대', '20대', '30대', '40대', '50대', '60대', '70대~'], dtype=object)

In [157]:
df.groupby(['연령대코드','대여구분코드']).size().reset_index()

   연령대코드 대여구분코드       0
0    20대    단체권     774
1    20대    일일권   59393
2    20대    정기권  187394
3    30대    단체권     458
4    30대    일일권   31127
5    30대    정기권  155137
6    40대    단체권    1099
7    40대    일일권   12695
8    40대    정기권  101005
9    50대    단체권     165
10   50대    일일권    4607
11   50대    정기권   65656
12   60대    단체권      30
13   60대    일일권     819
14   60대    정기권   18439
15  70대~    단체권      11
16  70대~    일일권     158
17  70대~    정기권    3058
18  ~10대    단체권     481
19  ~10대    일일권   11540
20  ~10대    정기권   24904

In [151]:
df.대여구분코드2 = df.대여구분코드

C:\Users\User\AppData\Local\Temp\ipykernel_4104\3383996336.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.대여구분코드2 = df.대여구분코드

In [152]:
df.대여구분코드2[df.대여구분코드2 == '일일권(비회원)'] = '일일권'

C:\Users\User\AppData\Local\Temp\ipykernel_4104\3493832088.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.대여구분코드2[df.대여구분코드2 == '일일권(비회원)'] = '일일권'

In [153]:
df.대여구분코드2.unique()

array(['정기권', '일일권', '단체권'], dtype=object)

In [165]:
(df[df.대여구분코드2 == '일일권'].groupby('연령대코드').size() / df.groupby('연령대코드').size()).sort_values(ascending = False)

연령대코드
~10대    0.312525
20대     0.239913
30대     0.166702
40대     0.110585
50대     0.065414
70대~    0.048962
60대     0.042462
dtype: float64

In [171]:
df[df.대여구분코드.isin(['일일권','일일권(비회원)'])].연령대코드.value_counts().sort_index()

20대     59393
30대     31127
40대     12695
50대      4607
60대       819
70대~      158
~10대    11540
Name: 연령대코드, dtype: int64

In [172]:
df.연령대코드.value_counts().sort_index()

20대     247561
30대     186722
40대     114799
50대      70428
60대      19288
70대~      3227
~10대     36925
Name: 연령대코드, dtype: int64

In [173]:
(df[df.대여구분코드.isin(['일일권','일일권(비회원)'])].연령대코드.value_counts().sort_index() / df.연령대코드.value_counts().sort_index()).sort_values(ascending = False)

~10대    0.312525
20대     0.239913
30대     0.166702
40대     0.110585
50대     0.065414
70대~    0.048962
60대     0.042462
Name: 연령대코드, dtype: float64

Q35. 연령대별 평균 이동거리를 구하여라

In [174]:
df.head(3)

,대여일자,대여시간,대여소번호,대여구분코드,성별,연령대코드,이용건수,운동량,탄소량,이동거리,사용시간,day_name
0,2021-06-01,0,3541,정기권,F,~10대,1,0.00,0.00,0.00,8,Tuesday
1,2021-06-01,0,765,정기권,F,~10대,1,27.21,0.35,1526.81,19,Tuesday
2,2021-06-01,0,2637,정기권,F,~10대,1,41.40,0.37,1608.56,18,Tuesday

In [183]:
df.groupby(['연령대코드']).mean()['이동거리']

연령대코드
20대     3211.890552
30대     3341.443859
40대     3514.857416
50대     3593.668100
60대     3538.145737
70대~    3085.039641
~10대    2634.426279
Name: 이동거리, dtype: float64

In [186]:
df[['연령대코드','이동거리']].groupby('연령대코드').mean()

              이동거리
연령대코드
20대    3211.890552
30대    3341.443859
40대    3514.857416
50대    3593.668100
60대    3538.145737
70대~   3085.039641
~10대   2634.426279

Q36. 연령대 코드가 20대인 데이터를 추출하고,이동거리값이 추출한 데이터의 이동거리값의 평균 이상인 데이터를 추출한다.최종 추출된 데이터를 대여일자, 대여소 번호 순서로 내림차순 정렬 후 1행부터 200행까지의 탄소량의 평균을 소숫점 3째 자리까지 구하여라

In [224]:
df[df.연령대코드 == '20대'][df[df.연령대코드 == '20대'].이동거리 >= df[df.연령대코드 == '20대'].이동거리.mean()]

,대여일자,대여시간,대여소번호,대여구분코드,성별,연령대코드,이용건수,운동량,탄소량,이동거리,사용시간,sex
12,2021-06-01,0,302,정기권,F,20대,1,141.61,1.38,5960.00,28,여
14,2021-06-01,0,2173,정기권,F,20대,1,86.47,0.96,4120.00,31,여
18,2021-06-01,0,116,정기권,F,20대,1,196.72,2.30,9935.24,42,여
24,2021-06-01,0,2619,정기권,F,20대,1,112.75,1.14,4909.12,35,여
30,2021-06-01,0,487,정기권,F,20대,1,113.91,1.21,5230.00,55,여
...,...,...,...,...,...,...,...,...,...,...,...,...
678748,2021-06-14,23,2102,정기권,M,20대,1,267.00,2.70,11624.95,44,남
678749,2021-06-14,23,1211,정기권,M,20대,1,100.64,0.81,3481.52,26,남
678753,2021-06-14,23,2034,정기권,M,20대,1,514.35,3.59,15462.66,49,남
678756,2021-06-14,23,502,정기권,M,20대,1,264.03,2.09,9010.00,43,남
678757,2021-06-14,23,722,정기권,M,20대,1,512.64,4.62,19916.21,97,남

In [232]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 678950 entries, 0 to 678949
Data columns (total 12 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    678950 non-null  object
 1   대여시간    678950 non-null  int64
 2   대여소번호   678950 non-null  int64
 3   대여구분코드  678950 non-null  object
 4   성별      678950 non-null  object
 5   연령대코드   678950 non-null  object
 6   이용건수    678950 non-null  int64
 7   운동량     678950 non-null  object
 8   탄소량     678950 non-null  object
 9   이동거리    678950 non-null  float64
 10  사용시간    678950 non-null  int64
 11  sex     678950 non-null  object
dtypes: float64(1), int64(4), object(7)
memory usage: 62.2+ MB

In [241]:
d = df[df.연령대코드 == '20대'][df[df.연령대코드 == '20대'].이동거리 >= df[df.연령대코드 == '20대'].이동거리.mean()].sort_values(['대여일자','대여소번호'], ascending = False).head(200).탄소량
d.astype('float').mean().round(3)

1.613

Q37. 6월 7일 ~10대의 “이용건수”의 중앙값은?

In [193]:
df[(df.대여일자 == '2021-06-07')&(df.연령대코드 == '~10대')].이용건수.median()

1.0

Q38. 평일 (월~금) 출근 시간대(오전 6,7,8시)의 대여소별 이용 횟수를 구해서 데이터 프레임 형태로 표현한 후 
## 각 대여시간별 이용 횟수의 상위 3개 대여소와 이용횟수를 출력하라

In [255]:
df[( df.day_name.isin(['Sunday','Saturday']) == False ) & df.대여시간.isin([6,7,8])].groupby('대여소번호').size().to_frame('이용횟수').sort_values('이용횟수',ascending = False).head(3)

       이용횟수
대여소번호
259     182
2701    180
247     171

In [260]:
df[( df.day_name.isin(['Sunday','Saturday']) == False ) & df.대여시간.isin([6,7,8])].groupby(['대여시간','대여소번호']).size().to_frame('이용횟수').sort_values(['대여시간','이용횟수'],ascending = False).groupby('대여시간').head(3)

            이용횟수
대여시간 대여소번호
8    2701    119
     646     115
     1152     92
7    259     104
     230      77
     726      77
6    2744     45
     1125     40
     1028     36

Q39. 이동거리의 평균 이상의 이동거리 값을 가지는 데이터를 추출하여 추출데이터의 이동거리의 표본표준편차 값을 구하여라

In [196]:
df[df.이동거리 >= df.이동거리.mean()].이동거리.std()

5092.139707505356

## Q40. 남성(‘M’ or ‘m’)과 여성(‘F’ or ‘f’)의 이동거리값의 평균값을 구하여라

In [197]:
df.성별.unique()

array(['F', 'M', 'm', 'f'], dtype=object)

In [211]:
df[df.성별.apply(lambda x: x.lower()) == 'm'].이동거리.mean()

3209.1108714530546

In [212]:
df[df.성별.apply(lambda x: x.lower()) == 'f'].이동거리.mean()

3468.5750252981957

In [213]:
df['sex'] = df.성별.apply(lambda x: '남' if x in ['M','m'] else '여')
df[['sex','이동거리']].groupby('sex').mean()

            이동거리
sex
남    3209.110871
여    3468.575025